## Importaciones necesarias

In [1]:
import pandas as pd 
import numpy as np

---

### Lectura de .csv df1:

In [2]:
df1 = pd.read_csv("data/calendar.csv")

df1.head(2)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,336834,2019-09-19,f,$63.00,$63.00,5,250
1,6369,2019-09-19,f,$70.00,$70.00,1,365

---

### Cantidad de filas y columnas df1:

In [3]:
print(f"Hay {df1.shape[0]} filas y {df1.shape[1]} de columnas.")

Hay 7605505 filas y 7 de columnas.

---

### Tipo de columnas df1:

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7605505 entries, 0 to 7605504
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   listing_id      int64
 1   date            object
 2   available       object
 3   price           object
 4   adjusted_price  object
 5   minimum_nights  int64
 6   maximum_nights  int64
dtypes: int64(3), object(4)
memory usage: 406.2+ MB

---

### Valores duplicados df1:

In [5]:
df1.duplicated().sum()

0

---

### Valores nulos df1:

In [6]:
df1.isna().sum()

listing_id        0
date              0
available         0
price             0
adjusted_price    0
minimum_nights    0
maximum_nights    0
dtype: int64

---

### Lectura de .csv df2:

In [7]:
df2 = pd.read_csv("data/listings.csv")

df2.head(2)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,6369,"Rooftop terrace room with ensuite bathroom, Airc.",13660,Simon,Chamartín,Hispanoamérica,40.45628,-3.67763,Private room,70,1,65,2019-09-04,0.56,1,53
1,21853,Bright and airy room,83531,Abdel,Latina,Cármenes,40.40341,-3.74084,Private room,17,4,33,2018-07-15,0.55,2,48

---

### Cantidad de filas y columnas df2:

In [8]:
print(f"Hay {df2.shape[0]} filas y {df2.shape[1]} de columnas.")

Hay 20837 filas y 16 de columnas.

---

### Tipo de columnas df2:

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20837 entries, 0 to 20836
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              20837 non-null  int64
 1   name                            20832 non-null  object
 2   host_id                         20837 non-null  int64
 3   host_name                       20822 non-null  object
 4   neighbourhood_group             20837 non-null  object
 5   neighbourhood                   20837 non-null  object
 6   latitude                        20837 non-null  float64
 7   longitude                       20837 non-null  float64
 8   room_type                       20837 non-null  object
 9   price                           20837 non-null  int64
 10  minimum_nights                  20837 non-null  int64
 11  number_of_reviews               20837 non-null  int64
 12  last_review                     16183 non-null  object
 13  reviews_per_month               16183 non-null  float64
 14  calculated_host_listings_count  20837 non-null  int64
 15  availability_365                20837 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 2.5+ MB

---

### Valores duplicados df2:

In [10]:
df2.duplicated().sum()

0

---

### Valores nulos df2:

In [11]:
df2.isna().sum()

id                                   0
name                                 5
host_id                              0
host_name                           15
neighbourhood_group                  0
neighbourhood                        0
latitude                             0
longitude                            0
room_type                            0
price                                0
minimum_nights                       0
number_of_reviews                    0
last_review                       4654
reviews_per_month                 4654
calculated_host_listings_count       0
availability_365                     0
dtype: int64

---

### Lectura de .csv df3:

In [12]:
df3 = pd.read_csv("data/neighbourhoods.csv")

df3.head(2)

  neighbourhood_group neighbourhood
0          Arganzuela       Acacias
1          Arganzuela        Atocha

---

### Cantidad de filas y columnas df3:

In [13]:
print(f"Hay {df3.shape[0]} filas y {df3.shape[1]} de columnas.")

Hay 128 filas y 2 de columnas.

---

### Tipo de columnas df3:

In [14]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 128 entries, 0 to 127
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   neighbourhood_group  128 non-null    object
 1   neighbourhood        128 non-null    object
dtypes: object(2)
memory usage: 2.1+ KB

---

### Valores duplicados df3:

In [15]:
df3.duplicated().sum()

0

---

### Valores nulos df3:

In [16]:
df3.isna().sum()

neighbourhood_group    0
neighbourhood          0
dtype: int64

---

### Lectura de .csv df4:

In [17]:
df4 = pd.read_csv("data/reviews_detailed.csv")

df4.head(2)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,6369,29428,2010-03-14,84790,Nancy,Simon and Arturo have the ultimate location in...
1,6369,31018,2010-03-23,84338,David,Myself and Kristy originally planned on stayin...

---

### Cantidad de filas y columnas df4:

In [18]:
print(f"Hay {df4.shape[0]} filas y {df4.shape[1]} de columnas.")

Hay 732710 filas y 6 de columnas.

---

### Tipo de columnas df4:

In [19]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 732710 entries, 0 to 732709
Data columns (total 6 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   listing_id     732710 non-null  int64
 1   id             732710 non-null  int64
 2   date           732710 non-null  object
 3   reviewer_id    732710 non-null  int64
 4   reviewer_name  732709 non-null  object
 5   comments       732410 non-null  object
dtypes: int64(3), object(3)
memory usage: 33.5+ MB

---

### Valores duplicados df4:

In [20]:
df4.duplicated().sum()

0

---

### Valores nulos df4:

In [21]:
df4.isna().sum()

listing_id         0
id                 0
date               0
reviewer_id        0
reviewer_name      1
comments         300
dtype: int64

---

### Cambio de año por mes:

In [22]:
df4.head(1)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,6369,29428,2010-03-14,84790,Nancy,Simon and Arturo have the ultimate location in...

In [23]:
df4['month'] = df4['date'].str.split('-').str[1]

---

### Eliminación de Columnas:

In [24]:
df1.head(1)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,336834,2019-09-19,f,$63.00,$63.00,5,250

In [25]:
df2 = df2.drop(columns=['host_name', 'name', 'last_review'])

In [26]:
df4 = df4.drop(columns=['reviewer_name', 'date'])

In [27]:
# Comprobación del df2:
df2.head(1)

,id,host_id,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
0,6369,13660,Chamartín,Hispanoamérica,40.45628,-3.67763,Private room,70,1,65,0.56,1,53

In [28]:
# Comprobación del df4:
df4.head(1)

,listing_id,id,reviewer_id,comments,month
0,6369,29428,84790,Simon and Arturo have the ultimate location in...,03

---

In [29]:
df2.to_csv("data/df2_modificado.csv")

In [30]:
df4.to_csv("data/df4_modificado.csv")